app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'student1@example.com'
 LIMIT 1
---
    public function login()
    {
        // Handle POST request (login submission)
        if ($this->request->getMethod() === 'POST') {
            $session = session();
            $userModel = new UserModel();

            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            // Validation rules
            $rules = [
                'email' => 'required|valid_email',
                'password' => 'required'
            ];

            if (!$this->validate($rules)) {
                return redirect()->back()->withInput()->with('error', 'Please provide valid email and password.');
            }

            try {
                // Find user by email
                $user = $userModel->where('email', $email)->first();

SELECT *
FROM `announcements`
ORDER BY `created_at` DESC
---

        // Load announcements for all roles
        $announcementModel = new AnnouncementModel();
        $data['announcements'] = $announcementModel->orderBy('created_at', 'DESC')->findAll();