app/Controllers/Course.php

SELECT *
FROM `courses`
---
    public function index()
    {
        $courseModel = new CourseModel();
        $data['courses'] = $courseModel->findAll();

SELECT *
FROM `courses`
WHERE `courses`.`id` = '12'
---
        $enrollmentModel = new EnrollmentModel();

        // Security Check 4: Course Existence - Verify course exists
        $course = $courseModel->find($courseId);